; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v2)
		(pred_2 ?v3)
		(pred_3 ?v5)
		(pred_1 ?v5)
		(pred_5 ?v3 ?v5)
		(pred_6)
		(pred_4 ?v3))

   (:action op_3
       :parameters  (?v1 ?v8)
       :precondition (and (not-eq ?v1 ?v8) 
                          (pred_3 ?v1) (pred_3 ?v8) (pred_1 ?v1))
       :effect (and  (pred_1 ?v8)
		     (not (pred_1 ?v1))))


   (:action op_1
       :parameters (?v7 ?v4)
       :precondition  (and  (pred_2 ?v7) (pred_3 ?v4)
			    (pred_5 ?v7 ?v4) (pred_1 ?v4) (pred_6))
       :effect (and (pred_4 ?v7)
		    (not (pred_5 ?v7 ?v4)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v7  ?v4)
       :precondition  (and  (pred_2 ?v7) (pred_3 ?v4)
			    (pred_4 ?v7) (pred_1 ?v4))
       :effect (and (pred_5 ?v7 ?v4)
		    (pred_6)
		    (not (pred_4 ?v7)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_04 obj_03 obj_02 
          obj_01 obj_05 
)
(:init
(pred_3 obj_04)
(pred_3 obj_03)
(pred_3 obj_02)
(pred_2 obj_01)
(pred_2 obj_05)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(pred_6)
(pred_5 obj_01 obj_03)
(pred_5 obj_05 obj_04)
(pred_1 obj_03)
)
(:goal
(and
(pred_5 obj_01 obj_04)
(pred_5 obj_05 obj_04)
)
)

(:constraints
  (sometime-before  (pred_5 obj_01 obj_04) (pred_1 obj_02))
)
)

; plan
1. (op_1 obj_01 obj_03)
   deleted: (pred_5 obj_01 obj_03) (pred_6)
   added: (pred_4 obj_01)
   goals met: 1 of 2
2. (op_3 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_02)
   goals met: 1 of 2
3. (op_2 obj_01 obj_02)
   deleted: (pred_4 obj_01)
   added: (pred_5 obj_01 obj_02) (pred_6)
   goals met: 1 of 2
4. (op_3 obj_02 obj_04)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_04)
   goals met: 1 of 2
5. (op_1 obj_05 obj_04)
   deleted: (pred_5 obj_05 obj_04) (pred_6)
   added: (pred_4 obj_05)
   goals met: 0 of 2
6. (op_3 obj_04 obj_02)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_02)
   goals met: 0 of 2
7. (op_2 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_5 obj_05 obj_02) (pred_6)
   goals met: 0 of 2
8. (op_1 obj_01 obj_02)
   deleted: (pred_5 obj_01 obj_02) (pred_6)
   added: (pred_4 obj_01)
   goals met: 0 of 2
9. (op_3 obj_02 obj_04)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_04)
   goals met: 0 of 2
10. (op_2 obj_01 obj_04)
   deleted: (pred_4 obj_01)
   added: (pred_5 obj_01 obj_04) (pred_6)
   goals met: 1 of 2
11. (op_3 obj_04 obj_02)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_02)
   goals met: 1 of 2
12. (op_1 obj_05 obj_02)
   deleted: (pred_5 obj_05 obj_02) (pred_6)
   added: (pred_4 obj_05)
   goals met: 1 of 2
13. (op_3 obj_02 obj_04)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_04)
   goals met: 1 of 2
14. (op_2 obj_05 obj_04)
   deleted: (pred_4 obj_05)
   added: (pred_5 obj_05 obj_04) (pred_6)
   goals met: 2 of 2
